In [22]:
import pandas as pd
import numpy as np

In [23]:
URL = r"D:\UM internship\Entertainer Data\Entertainer Data Analysis\Entertainer - Basic Info.xlsx"
df_info = pd.read_excel(URL)

In [24]:
df_info

        Entertainer Gender (traditional)  Birth Year
0             Adele                    F        1988
1    Angelina Jolie                    F        1975
2   Aretha Franklin                    F        1942
3       Bette Davis                    F        1908
4       Betty White                    F        1922
..              ...                  ...         ...
65        Tom Hanks                    M        1956
66     Tony Bennett                    M        1926
67     Wayne Newton                    M        1942
68       Will Smith                    M        1968
69    Willie Nelson                    M        1933

[70 rows x 3 columns]

In [25]:
df_info.shape

(70, 3)

In [26]:
df_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Entertainer           70 non-null     object
 1   Gender (traditional)  70 non-null     object
 2   Birth Year            70 non-null     int64
dtypes: int64(1), object(2)
memory usage: 1.8+ KB

In [27]:
df_break_info = pd.read_excel(r"D:\UM internship\Entertainer Data\Entertainer Data Analysis\Entertainer - Breakthrough Info.xlsx")
df_break_info.head()

,Entertainer,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,Adele,2008,19,2009.0
1,Angelina Jolie,1999,"Girl, Interrupted",1999.0
2,Aretha Franklin,1967,I Never Loved a Man (The Way I Love You),1968.0
3,Bette Davis,1934,Of Human Bondage,1935.0
4,Betty White,1952,Life with Elilzabeth,1976.0

In [28]:
df_break_info.shape

(70, 4)

In [29]:
df_break_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 4 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Entertainer                                   70 non-null     object
 1   Year of Breakthrough/#1 Hit/Award Nomination  70 non-null     int64
 2   Breakthrough Name                             70 non-null     object
 3   Year of First Oscar/Grammy/Emmy               64 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.3+ KB

In [30]:
df_break_info.drop('Entertainer', axis = 1, inplace = True)

In [31]:
df_break_info.head()

,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,2008,19,2009.0
1,1999,"Girl, Interrupted",1999.0
2,1967,I Never Loved a Man (The Way I Love You),1968.0
3,1934,Of Human Bondage,1935.0
4,1952,Life with Elilzabeth,1976.0

In [32]:
df_last_work = pd.read_excel(r"D:\UM internship\Entertainer Data\Entertainer Data Analysis\Entertainer - Last work Info.xlsx")
df_last_work.head()

       Entertainer  Year of Last Major Work (arguable)  Year of Death
0            Adele                                2016            NaN
1   Angelina Jolie                                2016            NaN
2  Aretha Franklin                                2014            NaN
3      Bette Davis                                1989         1989.0
4      Betty White                                2016            NaN

In [33]:
df_last_work.shape

(70, 3)

In [34]:
df_last_work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 3 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Entertainer                         70 non-null     object
 1   Year of Last Major Work (arguable)  70 non-null     int64
 2   Year of Death                       30 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.8+ KB

In [35]:
df_last_work.drop('Entertainer', axis = 1, inplace = True)

In [36]:
df_last_work.head()

   Year of Last Major Work (arguable)  Year of Death
0                                2016            NaN
1                                2016            NaN
2                                2014            NaN
3                                1989         1989.0
4                                2016            NaN

In [37]:
#concating the first two tables
concat1 = pd.concat([df_info, df_break_info], axis =1)

In [38]:
concat1.head()

,Entertainer,Gender (traditional),Birth Year,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,Adele,F,1988,2008,19,2009.0
1,Angelina Jolie,F,1975,1999,"Girl, Interrupted",1999.0
2,Aretha Franklin,F,1942,1967,I Never Loved a Man (The Way I Love You),1968.0
3,Bette Davis,F,1908,1934,Of Human Bondage,1935.0
4,Betty White,F,1922,1952,Life with Elilzabeth,1976.0

In [39]:
concat1.shape

(70, 6)

In [41]:
concat1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 6 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Entertainer                                   70 non-null     object
 1   Gender (traditional)                          70 non-null     object
 2   Birth Year                                    70 non-null     int64
 3   Year of Breakthrough/#1 Hit/Award Nomination  70 non-null     int64
 4   Breakthrough Name                             70 non-null     object
 5   Year of First Oscar/Grammy/Emmy               64 non-null     float64
dtypes: float64(1), int64(2), object(3)
memory usage: 3.4+ KB

In [42]:
concat2 = pd.concat([concat1, df_last_work], axis = 1)

In [43]:
concat2.head()

,Entertainer,Gender (traditional),Birth Year,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy,Year of Last Major Work (arguable),Year of Death
0,Adele,F,1988,2008,19,2009.0,2016,NaN
1,Angelina Jolie,F,1975,1999,"Girl, Interrupted",1999.0,2016,NaN
2,Aretha Franklin,F,1942,1967,I Never Loved a Man (The Way I Love You),1968.0,2014,NaN
3,Bette Davis,F,1908,1934,Of Human Bondage,1935.0,1989,1989.0
4,Betty White,F,1922,1952,Life with Elilzabeth,1976.0,2016,NaN

In [44]:
concat2.shape

(70, 8)

In [52]:
concat2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 8 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Entertainer                                   70 non-null     object
 1   Gender (traditional)                          70 non-null     object
 2   Birth Year                                    70 non-null     int64
 3   Year of Breakthrough/#1 Hit/Award Nomination  70 non-null     int64
 4   Breakthrough Name                             70 non-null     object
 5   Year of First Oscar/Grammy/Emmy               64 non-null     float64
 6   Year of Last Major Work (arguable)            70 non-null     int64
 7   Year of Death                                 30 non-null     float64
dtypes: float64(2), int64(3), object(3)
memory usage: 4.5+ KB

In [55]:
concat2['Year of First Oscar/Grammy/Emmy'] = concat2['Year of First Oscar/Grammy/Emmy'].apply(lambda x: int(x) if not pd.isna(x) else np.nan)

In [56]:
concat2.head()

,Entertainer,Gender (traditional),Birth Year,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy,Year of Last Major Work (arguable),Year of Death
0,Adele,F,1988,2008,19,2009.0,2016,NaN
1,Angelina Jolie,F,1975,1999,"Girl, Interrupted",1999.0,2016,NaN
2,Aretha Franklin,F,1942,1967,I Never Loved a Man (The Way I Love You),1968.0,2014,NaN
3,Bette Davis,F,1908,1934,Of Human Bondage,1935.0,1989,1989.0
4,Betty White,F,1922,1952,Life with Elilzabeth,1976.0,2016,NaN

In [58]:
concat2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 8 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Entertainer                                   70 non-null     object
 1   Gender (traditional)                          70 non-null     object
 2   Birth Year                                    70 non-null     int64
 3   Year of Breakthrough/#1 Hit/Award Nomination  70 non-null     int64
 4   Breakthrough Name                             70 non-null     object
 5   Year of First Oscar/Grammy/Emmy               64 non-null     float64
 6   Year of Last Major Work (arguable)            70 non-null     int64
 7   Year of Death                                 30 non-null     float64
dtypes: float64(2), int64(3), object(3)
memory usage: 4.5+ KB

In [61]:
concat2['Year of First Oscar/Grammy/Emmy'] = pd.to_numeric(concat2['Year of First Oscar/Grammy/Emmy'], errors='coerce').astype('Int64')

In [63]:
concat2.head()

,Entertainer,Gender (traditional),Birth Year,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy,Year of Last Major Work (arguable),Year of Death
0,Adele,F,1988,2008,19,2009,2016,NaN
1,Angelina Jolie,F,1975,1999,"Girl, Interrupted",1999,2016,NaN
2,Aretha Franklin,F,1942,1967,I Never Loved a Man (The Way I Love You),1968,2014,NaN
3,Bette Davis,F,1908,1934,Of Human Bondage,1935,1989,1989.0
4,Betty White,F,1922,1952,Life with Elilzabeth,1976,2016,NaN

In [68]:
concat2.to_excel(r'D:\UM internship\Entertainer Data\Entertainer Data Analysis\concat2.xlsx', index = False)

In [69]:
concat2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70 entries, 0 to 69
Data columns (total 8 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Entertainer                                   70 non-null     object
 1   Gender (traditional)                          70 non-null     object
 2   Birth Year                                    70 non-null     int64
 3   Year of Breakthrough/#1 Hit/Award Nomination  70 non-null     int64
 4   Breakthrough Name                             70 non-null     object
 5   Year of First Oscar/Grammy/Emmy               64 non-null     Int64
 6   Year of Last Major Work (arguable)            70 non-null     int64
 7   Year of Death                                 30 non-null     float64
dtypes: Int64(1), float64(1), int64(3), object(3)
memory usage: 4.6+ KB